RubenKelevra/espressif_esp32-camera/driver/cam_hal.c
// Copyright 2010-2020 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#include <stdio.h>
#include <string.h>
#include <stdalign.h>
#include "esp_heap_caps.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "ll_cam.h"
#include "cam_hal.h"
#include "esp_camera_cache.h"

#if (ESP_IDF_VERSION_MAJOR == 3) && (ESP_IDF_VERSION_MINOR == 3)
#include "rom/ets_sys.h"
#else
#include "esp_timer.h"
#include "esp_cache.h"
#include "hal/cache_hal.h"
#include "hal/cache_ll.h"
#include "esp_idf_version.h"
#ifndef ESP_CACHE_MSYNC_FLAG_DIR_M2C
#define ESP_CACHE_MSYNC_FLAG_DIR_M2C 0
#endif
#if CONFIG_IDF_TARGET_ESP32
#include "esp32/rom/ets_sys.h"  // will be removed in idf v5.0
#elif CONFIG_IDF_TARGET_ESP32S2
#include "esp32s2/rom/ets_sys.h"
#elif CONFIG_IDF_TARGET_ESP32S3
#include "esp32s3/rom/ets_sys.h"
#endif
#endif // ESP_IDF_VERSION_MAJOR

#if CONFIG_LOG_DEFAULT_LEVEL_NONE
#define ESP_CAMERA_ETS_PRINTF(f, ...)
#else
#define ESP_CAMERA_ETS_PRINTF(f, ...) ets_printf(f, ##__VA_ARGS__)
#endif

#if CONFIG_CAMERA_TASK_STACK_SIZE
#define CAM_TASK_STACK             CONFIG_CAMERA_TASK_STACK_SIZE
#else
#define CAM_TASK_STACK             (4*1024)
#endif

static const char *TAG = "cam_hal";
static cam_obj_t *cam_obj = NULL;
#if defined(CONFIG_CAMERA_PSRAM_DMA)
#define CAMERA_PSRAM_DMA_ENABLED CONFIG_CAMERA_PSRAM_DMA
#else
#define CAMERA_PSRAM_DMA_ENABLED 0
#endif

static volatile bool g_psram_dma_mode = CAMERA_PSRAM_DMA_ENABLED;
static portMUX_TYPE g_psram_dma_lock = portMUX_INITIALIZER_UNLOCKED;

/* At top of cam_hal.c – one switch for noisy ISR prints */
#ifndef CAM_LOG_SPAM_EVERY_FRAME
#define CAM_LOG_SPAM_EVERY_FRAME 0   /* set to 1 to restore old behaviour */
#endif

/* Number of bytes copied to SRAM for SOI validation when capturing
 * directly to PSRAM. Tunable to probe more of the frame start if needed. */
#ifndef CAM_SOI_PROBE_BYTES
#define CAM_SOI_PROBE_BYTES 32
#endif
/*
 * PSRAM DMA may bypass the CPU cache. Always call esp_cache_msync() on
 * PSRAM regions that the CPU will read so cached reads see the data written
 * by DMA.
 */

 * Invalidate CPU data cache lines that cover a region in PSRAM which
 * has just been written by DMA. This guarantees subsequent CPU reads
 * fetch the fresh data from PSRAM rather than stale cache contents.
 * Both address and length are aligned to the data cache line size.
 */
static inline void cam_drop_psram_cache(void *addr, size_t len)
{
    size_t line = esp_camera_dcache_line_size();
    uintptr_t start = (uintptr_t)addr & ~(line - 1);
    size_t sync_len = (len + ((uintptr_t)addr - start) + line - 1) & ~(line - 1);
    esp_err_t err = esp_cache_msync((void *)start, sync_len, ESP_CACHE_MSYNC_FLAG_DIR_M2C);
    if (err != ESP_OK) {
        ESP_CAMERA_ETS_PRINTF(DRAM_STR("cam_hal: cache msync failed addr=%p len=%u aligned=%p aligned_len=%u err=%d\r\n"),
                              addr, (unsigned)len, (void *)start, (unsigned)sync_len, (int)err);
    }
}

/* Throttle repeated warnings printed from tight loops / ISRs.
 *
 * counter – static DRAM/IRAM uint16_t you pass in
 * first   – literal C string shown on first hit and as prefix of summaries
 */
#if CONFIG_LOG_DEFAULT_LEVEL >= 2
#define CAM_WARN_THROTTLE(counter, first)                                  \
    do {                                                                  \
        if (++(counter) == 1) {                                           \
            ESP_CAMERA_ETS_PRINTF(DRAM_STR("cam_hal: %s\r\n"), first);        \
        } else if ((counter) % 100 == 0) {                                \
            ESP_CAMERA_ETS_PRINTF(DRAM_STR("cam_hal: %s - 100 additional misses\r\n"), first); \
        }                                                                 \
        if ((counter) == 10000) (counter) = 1;                            \
    } while (0)
#else
#define CAM_WARN_THROTTLE(counter, first) do { (void)(counter); } while (0)
#endif

/* JPEG markers (byte-order independent). */
static const uint8_t JPEG_SOI_MARKER[] = {0xFF, 0xD8, 0xFF}; /* SOI = FF D8 FF */
#define JPEG_SOI_MARKER_LEN (3)
static const uint8_t JPEG_EOI_BYTES[] = {0xFF, 0xD9};        /* EOI = FF D9 */
#define JPEG_EOI_MARKER_LEN (2)

/* Compute the scan window for JPEG EOI detection in PSRAM. */
static inline size_t eoi_probe_window(size_t half, size_t frame_len)
{
    size_t w = half + (JPEG_EOI_MARKER_LEN - 1);
    return w > frame_len ? frame_len : w;
}

static int cam_verify_jpeg_soi(const uint8_t *inbuf, uint32_t length)
{
    static uint16_t warn_soi_miss_cnt = 0;
    if (length < JPEG_SOI_MARKER_LEN) {
        CAM_WARN_THROTTLE(warn_soi_miss_cnt,
                          "NO-SOI - JPEG start marker missing (len < 3b)");
        return -1;
    }

    for (uint32_t i = 0; i <= length - JPEG_SOI_MARKER_LEN; i++) {
        if (memcmp(&inbuf[i], JPEG_SOI_MARKER, JPEG_SOI_MARKER_LEN) == 0) {
            //ESP_LOGW(TAG, "SOI: %d", (int) i);
            return i;
        }
    }

    CAM_WARN_THROTTLE(warn_soi_miss_cnt,
                      "NO-SOI - JPEG start marker missing");
    return -1;
}

static int cam_verify_jpeg_eoi(const uint8_t *inbuf, uint32_t length, bool search_forward)
{
    if (length < JPEG_EOI_MARKER_LEN) {
        return -1;
    }

    if (search_forward) {
        /* Scan forward to honor the earliest marker in the buffer. This avoids
         * returning an EOI that belongs to a larger previous frame when the tail
         * of that frame still resides in PSRAM. JPEG data is pseudo random, so
         * the first marker byte appears rarely; test four positions per load to
         * reduce memory traffic. */
        const uint8_t *pat = JPEG_EOI_BYTES;
        const uint32_t A = pat[0] * 0x01010101u;
        const uint32_t ONE = 0x01010101u;
        const uint32_t HIGH = 0x80808080u;
        uint32_t i = 0;
        while (i + 4 <= length) {
            uint32_t w;
            memcpy(&w, inbuf + i, 4); /* unaligned load is allowed */
            uint32_t x = w ^ A; /* identify bytes equal to first marker byte */
            uint32_t m = (~x & (x - ONE)) & HIGH; /* mask has high bit set for candidate bytes */
            while (m) { /* handle only candidates to avoid unnecessary memcmp calls */
                unsigned off = __builtin_ctz(m) >> 3;
                uint32_t pos = i + off;
                if (pos + JPEG_EOI_MARKER_LEN <= length &&
                    memcmp(inbuf + pos, pat, JPEG_EOI_MARKER_LEN) == 0) {
                    return pos;
                }
                m &= m - 1; /* clear processed candidate */
            }
            i += 4;
        }
        for (; i + JPEG_EOI_MARKER_LEN <= length; i++) {
            if (memcmp(inbuf + i, pat, JPEG_EOI_MARKER_LEN) == 0) {
                return i;
            }
        }
        return -1;
    }

    const uint8_t *dptr = inbuf + length - JPEG_EOI_MARKER_LEN;
    while (dptr >= inbuf) {
        if (memcmp(dptr, JPEG_EOI_BYTES, JPEG_EOI_MARKER_LEN) == 0) {
            return dptr - inbuf;
        }
        if (dptr == inbuf) {
            break;
        }
        dptr--;
    }
    return -1;
}

static bool cam_get_next_frame(int * frame_pos)
{
    if(!cam_obj->frames[*frame_pos].en){
        for (int x = 0; x < cam_obj->frame_cnt; x++) {
            if (cam_obj->frames[x].en) {
                *frame_pos = x;
                return true;
            }
        }
    } else {
        return true;
    }
    return false;
}

static bool cam_start_frame(int * frame_pos)
{
    if (cam_get_next_frame(frame_pos)) {
        if(ll_cam_start(cam_obj, *frame_pos)){
            // Vsync the frame manually
            ll_cam_do_vsync(cam_obj);
            uint64_t us = (uint64_t)esp_timer_get_time();
            cam_obj->frames[*frame_pos].fb.timestamp.tv_sec = us / 1000000UL;
            cam_obj->frames[*frame_pos].fb.timestamp.tv_usec = us % 1000000UL;
            return true;
        }
    }
    return false;
}

void IRAM_ATTR ll_cam_send_event(cam_obj_t *cam, cam_event_t cam_event, BaseType_t * HPTaskAwoken)
{
    if (xQueueSendFromISR(cam->event_queue, (void *)&cam_event, HPTaskAwoken) != pdTRUE) {
        ll_cam_stop(cam);
        cam->state = CAM_STATE_IDLE;
#if CAM_LOG_SPAM_EVERY_FRAME
        ESP_DRAM_LOGD(TAG, "EV-%s-OVF", cam_event==CAM_IN_SUC_EOF_EVENT ? "EOF" : "VSYNC");
#else
        static uint16_t ovf_cnt = 0;
        CAM_WARN_THROTTLE(ovf_cnt,
                          cam_event==CAM_IN_SUC_EOF_EVENT ? "EV-EOF-OVF" : "EV-VSYNC-OVF");
#endif
    }
}

